// RigVMMemoryStorageGeneratorClass M_MED_Golf_Deform_CtrlRig_twists.RigVMMemory_Work
// Size: 0x1260 (Inherited: 0x28)
struct URigVMMemory_Work : URigVMMemoryStorage {
	struct FControlRigExecuteContext ExecuteContext_; // 0x28(0x30)
	char pad_58[0x8]; // 0x58(0x08)
	struct FQuat RigVMModel___MathQuaternionFromAxisAndAngle_1_1_1_1_2_Result; // 0x60(0x20)
	struct FVector RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_2_Axis; // 0x80(0x18)
	char pad_98[0x8]; // 0x98(0x08)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_2_Twist; // 0xa0(0x20)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_2_Transform; // 0xc0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_2_CachedBone; // 0x120(0x10)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_2_Input; // 0x130(0x20)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_2_Swing; // 0x150(0x20)
	float RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_2_Angle; // 0x170(0x04)
	float RigVMModel___MathFloatMul_3_1_1_1_1_2_Result; // 0x174(0x04)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_2_CachedBone; // 0x178(0x10)
	char pad_188[0x8]; // 0x188(0x08)
	struct FQuat RigVMModel___MathQuaternionFromAxisAndAngle_1_1_1_1_Result; // 0x190(0x20)
	struct FVector RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_Axis; // 0x1b0(0x18)
	char pad_1C8[0x8]; // 0x1c8(0x08)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_Twist; // 0x1d0(0x20)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_Transform; // 0x1f0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_CachedBone; // 0x250(0x10)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_Input; // 0x260(0x20)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_Swing; // 0x280(0x20)
	float RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_Angle; // 0x2a0(0x04)
	float RigVMModel___MathFloatMul_3_1_1_1_1_Result; // 0x2a4(0x04)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_CachedBone; // 0x2a8(0x10)
	char pad_2B8[0x8]; // 0x2b8(0x08)
	struct FQuat RigVMModel___MathQuaternionFromAxisAndAngle_1_1_1_1_2_1_Result; // 0x2c0(0x20)
	struct FVector RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_2_1_Axis; // 0x2e0(0x18)
	char pad_2F8[0x8]; // 0x2f8(0x08)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_2_1_Twist; // 0x300(0x20)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_2_1_Transform; // 0x320(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_2_1_CachedBone; // 0x380(0x10)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_2_1_Input; // 0x390(0x20)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_2_1_Swing; // 0x3b0(0x20)
	float RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_2_1_Angle; // 0x3d0(0x04)
	float RigVMModel___MathFloatMul_3_1_1_1_1_2_1_Result; // 0x3d4(0x04)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_2_1_CachedBone; // 0x3d8(0x10)
	char pad_3E8[0x8]; // 0x3e8(0x08)
	struct FQuat RigVMModel___MathQuaternionFromAxisAndAngle_1_1_1_Result; // 0x3f0(0x20)
	struct FVector RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_Axis; // 0x410(0x18)
	char pad_428[0x8]; // 0x428(0x08)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_Twist; // 0x430(0x20)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_1_1_Transform; // 0x450(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_1_1_CachedBone; // 0x4b0(0x10)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_Input; // 0x4c0(0x20)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_Swing; // 0x4e0(0x20)
	float RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_Angle; // 0x500(0x04)
	float RigVMModel___MathFloatMul_3_1_1_1_Result; // 0x504(0x04)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_1_CachedBone; // 0x508(0x10)
	char pad_518[0x8]; // 0x518(0x08)
	struct FQuat RigVMModel___MathQuaternionFromAxisAndAngle_1_1_1_1_1_Result; // 0x520(0x20)
	struct FVector RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_1_Axis; // 0x540(0x18)
	char pad_558[0x8]; // 0x558(0x08)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_1_Twist; // 0x560(0x20)
	struct FTransform RigVMModel___MathTransformMakeRelative_1_Local; // 0x580(0x60)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_1_2_1_Transform; // 0x5e0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_1_2_1_CachedBone; // 0x640(0x10)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_1_Transform; // 0x650(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_1_CachedBone; // 0x6b0(0x10)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_1_Input; // 0x6c0(0x20)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_1_Swing; // 0x6e0(0x20)
	float RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_1_Angle; // 0x700(0x04)
	float RigVMModel___MathFloatMul_3_1_1_1_1_1_Result; // 0x704(0x04)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_1_CachedBone; // 0x708(0x10)
	char pad_718[0x8]; // 0x718(0x08)
	struct FQuat RigVMModel___MathQuaternionFromAxisAndAngle_1_1_1_1_1_2_Result; // 0x720(0x20)
	struct FVector RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_1_2_Axis; // 0x740(0x18)
	char pad_758[0x8]; // 0x758(0x08)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_1_1_Twist; // 0x760(0x20)
	struct FTransform RigVMModel___MathTransformMakeRelative_Local; // 0x780(0x60)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_1_2_Transform; // 0x7e0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_1_2_CachedBone; // 0x840(0x10)
	struct FTransform RigVMModel___RigUnit_GetInitialBoneTransform_Transform; // 0x850(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetInitialBoneTransform_CachedBone; // 0x8b0(0x10)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_1_1_Input; // 0x8c0(0x20)
	struct FQuat RigVMModel___MathQuaternionSwingTwist_1_1_1_1_1_1_Swing; // 0x8e0(0x20)
	float RigVMModel___MathQuaternionToAxisAndAngle_1_1_1_1_1_2_Angle; // 0x900(0x04)
	float RigVMModel___MathFloatMul_3_1_1_1_1_1_2_Result; // 0x904(0x04)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_1_2_CachedBone; // 0x908(0x10)
	char pad_918[0x8]; // 0x918(0x08)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_Transform; // 0x920(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_CachedBone; // 0x980(0x10)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_Transform; // 0x990(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_CachedBone; // 0x9f0(0x10)
	struct TArray<struct FConstraintTarget> RigVMModel___TransformConstraint_Targets__IO; // 0xa00(0x10)
	struct TArray<struct FRigUnit_TransformConstraint_WorkData> RigVMModel___TransformConstraint_WorkData; // 0xa10(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_Result; // 0xa20(0x20)
	struct FVector RigVMModel___MathQuaternionToEuler_3_1_Result; // 0xa40(0x18)
	char pad_A58[0x8]; // 0xa58(0x08)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_3_1_Transform; // 0xa60(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_3_1_CachedBone; // 0xac0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_3_1_Value; // 0xad0(0x20)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_1_Euler__IO; // 0xaf0(0x18)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_CachedBone; // 0xb08(0x10)
	char pad_B18[0x8]; // 0xb18(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_1_Result; // 0xb20(0x20)
	float RigVMModel___MathFloatMul_Result; // 0xb40(0x04)
	float RigVMModel___MathFloatMul_A; // 0xb44(0x04)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_1_1_Euler__IO; // 0xb48(0x18)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_CachedBone; // 0xb60(0x10)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_1_Transform; // 0xb70(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_1_CachedBone; // 0xbd0(0x10)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_2_Transform; // 0xbe0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_2_CachedBone; // 0xc40(0x10)
	struct TArray<struct FConstraintTarget> RigVMModel___TransformConstraint_1_Targets__IO; // 0xc50(0x10)
	struct TArray<struct FRigUnit_TransformConstraint_WorkData> RigVMModel___TransformConstraint_1_WorkData; // 0xc60(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_Result; // 0xc70(0x20)
	struct FVector RigVMModel___MathQuaternionToEuler_3_Result; // 0xc90(0x18)
	char pad_CA8[0x8]; // 0xca8(0x08)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_3_Transform; // 0xcb0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_3_CachedBone; // 0xd10(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_3_Value; // 0xd20(0x20)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_Euler__IO; // 0xd40(0x18)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_CachedBone; // 0xd58(0x10)
	char pad_D68[0x8]; // 0xd68(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_1_1_Result; // 0xd70(0x20)
	float RigVMModel___MathFloatMul_1_Result; // 0xd90(0x04)
	float RigVMModel___MathFloatMul_1_A; // 0xd94(0x04)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_1_1_1_Euler__IO; // 0xd98(0x18)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_2_CachedBone; // 0xdb0(0x10)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_2_Transform; // 0xdc0(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_2_CachedBone; // 0xe20(0x10)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_4_Transform; // 0xe30(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_4_CachedBone; // 0xe90(0x10)
	struct TArray<struct FConstraintTarget> RigVMModel___TransformConstraint_2_Targets__IO; // 0xea0(0x10)
	struct TArray<struct FRigUnit_TransformConstraint_WorkData> RigVMModel___TransformConstraint_2_WorkData; // 0xeb0(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_2_Result; // 0xec0(0x20)
	struct FVector RigVMModel___MathQuaternionToEuler_3_1_1_Result; // 0xee0(0x18)
	char pad_EF8[0x8]; // 0xef8(0x08)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_3_1_1_Transform; // 0xf00(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_3_1_1_CachedBone; // 0xf60(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_3_1_1_Value; // 0xf70(0x20)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_1_2_Euler__IO; // 0xf90(0x18)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_2_CachedBone; // 0xfa8(0x10)
	char pad_FB8[0x8]; // 0xfb8(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_1_2_Result; // 0xfc0(0x20)
	float RigVMModel___MathFloatMul_2_Result; // 0xfe0(0x04)
	float RigVMModel___MathFloatMul_2_A; // 0xfe4(0x04)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_1_1_2_Euler__IO; // 0xfe8(0x18)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_3_CachedBone; // 0x1000(0x10)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_1_2_1_Transform; // 0x1010(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_1_2_1_CachedBone; // 0x1070(0x10)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_4_1_Transform; // 0x1080(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_4_1_CachedBone; // 0x10e0(0x10)
	struct TArray<struct FConstraintTarget> RigVMModel___TransformConstraint_2_1_Targets__IO; // 0x10f0(0x10)
	struct TArray<struct FRigUnit_TransformConstraint_WorkData> RigVMModel___TransformConstraint_2_1_WorkData; // 0x1100(0x10)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_2_1_Result; // 0x1110(0x20)
	struct FVector RigVMModel___MathQuaternionToEuler_3_1_1_1_Result; // 0x1130(0x18)
	char pad_1148[0x8]; // 0x1148(0x08)
	struct FTransform RigVMModel___RigUnit_GetBoneTransform_3_1_1_1_Transform; // 0x1150(0x60)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_GetBoneTransform_3_1_1_1_CachedBone; // 0x11b0(0x10)
	struct FQuat RigVMModel___MathQuaternionToEuler_3_1_1_1_Value; // 0x11c0(0x20)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_1_2_1_Euler__IO; // 0x11e0(0x18)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_2_1_CachedBone; // 0x11f8(0x10)
	char pad_1208[0x8]; // 0x1208(0x08)
	struct FQuat RigVMModel___MathQuaternionFromEuler_4_1_1_2_1_Result; // 0x1210(0x20)
	float RigVMModel___MathFloatMul_2_1_Result; // 0x1230(0x04)
	float RigVMModel___MathFloatMul_2_1_A; // 0x1234(0x04)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_1_1_2_1_Euler__IO; // 0x1238(0x18)
	struct TArray<struct FCachedRigElement> RigVMModel___RigUnit_SetBoneRotation_1_1_3_1_CachedBone; // 0x1250(0x10)
};

// RigVMMemoryStorageGeneratorClass M_MED_Golf_Deform_CtrlRig_twists.RigVMMemory_Literal
// Size: 0x181 (Inherited: 0x28)
struct URigVMMemory_Literal : URigVMMemoryStorage {
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_2_Bone__Const; // 0x28(0x04)
	struct FName RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_2_Bone__Const; // 0x2c(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_2_Space__Const; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct FVector RigVMModel___MathQuaternionSwingTwist_1_1_1_1_2_TwistAxis__Const; // 0x38(0x18)
	float RigVMModel___MathFloatMul_3_1_1_1_1_2_B__Const; // 0x50(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_2_Space__Const; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	float RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_2_Weight__Const; // 0x58(0x04)
	char RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_2_bPropagateToChildren__Const : 1; // 0x5c(0x01)
	char pad_5C_1 : 7; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_Bone__Const; // 0x60(0x04)
	float RigVMModel___MathFloatMul_3_1_1_1_1_B__Const; // 0x64(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_Space__Const; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_2_1_Bone__Const; // 0x6c(0x04)
	struct FName RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_2_1_Bone__Const; // 0x70(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_2_1_Space__Const; // 0x74(0x01)
	char pad_75[0x3]; // 0x75(0x03)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_1_Bone__Const; // 0x78(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_1_Space__Const; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_1_Bone__Const; // 0x80(0x04)
	struct FName RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_1_2_1_Bone__Const; // 0x84(0x04)
	float RigVMModel___MathFloatMul_3_1_1_1_1_1_B__Const; // 0x88(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_1_Space__Const; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_1_1_1_2_Bone__Const; // 0x90(0x04)
	struct FName RigVMModel___RigUnit_GetBoneTransform_1_1_1_1_1_2_Bone__Const; // 0x94(0x04)
	struct FName RigVMModel___TransformConstraint_Bone__Const; // 0x98(0x04)
	enum class ETransformSpaceMode RigVMModel___TransformConstraint_BaseTransformSpace__Const; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	struct FTransform RigVMModel___TransformConstraint_BaseTransform__Const; // 0xa0(0x60)
	struct FName RigVMModel___TransformConstraint_BaseBone__Const; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct TArray<struct FConstraintTarget> RigVMModel___TransformConstraint_Targets__Const; // 0x108(0x10)
	struct FName RigVMModel___RigUnit_GetBoneTransform_1_Bone__Const; // 0x118(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_GetBoneTransform_1_Space__Const; // 0x11c(0x01)
	char pad_11D[0x3]; // 0x11d(0x03)
	struct FVector RigVMModel___MathQuaternionFromEuler_4_1_Euler__Const; // 0x120(0x18)
	enum class EEulerRotationOrder RigVMModel___MathQuaternionToEuler_3_1_RotationOrder__Const; // 0x138(0x01)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_Space__Const; // 0x139(0x01)
	char pad_13A[0x2]; // 0x13a(0x02)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_Bone__Const; // 0x13c(0x04)
	float RigVMModel___MathFloatMul_B__Const; // 0x140(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_Space__Const; // 0x144(0x01)
	char pad_145[0x3]; // 0x145(0x03)
	struct FName RigVMModel___TransformConstraint_1_Bone__Const; // 0x148(0x04)
	struct FName RigVMModel___RigUnit_GetBoneTransform_1_1_Bone__Const; // 0x14c(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_Space__Const; // 0x150(0x01)
	char pad_151[0x3]; // 0x151(0x03)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_2_Bone__Const; // 0x154(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_2_Space__Const; // 0x158(0x01)
	char pad_159[0x3]; // 0x159(0x03)
	struct FName RigVMModel___TransformConstraint_2_Bone__Const; // 0x15c(0x04)
	struct FName RigVMModel___RigUnit_GetBoneTransform_1_2_Bone__Const; // 0x160(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_2_Space__Const; // 0x164(0x01)
	char pad_165[0x3]; // 0x165(0x03)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_3_Bone__Const; // 0x168(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_3_Space__Const; // 0x16c(0x01)
	char pad_16D[0x3]; // 0x16d(0x03)
	struct FName RigVMModel___TransformConstraint_2_1_Bone__Const; // 0x170(0x04)
	struct FName RigVMModel___RigUnit_GetBoneTransform_1_2_1_Bone__Const; // 0x174(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_2_1_Space__Const; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	struct FName RigVMModel___RigUnit_SetBoneRotation_1_1_3_1_Bone__Const; // 0x17c(0x04)
	enum class EBoneGetterSetterMode RigVMModel___RigUnit_SetBoneRotation_1_1_3_1_Space__Const; // 0x180(0x01)
};

// ControlRigBlueprintGeneratedClass M_MED_Golf_Deform_CtrlRig_twists.M_MED_Golf_Deform_CtrlRig_twists_C
// Size: 0x540 (Inherited: 0x540)
struct UM_MED_Golf_Deform_CtrlRig_twists_C : UControlRig {
};

