// AnimBlueprintGeneratedClass M_MED_Prime_AnimBP.M_MED_Prime_AnimBP_C
// Size: 0x7e32 (Inherited: 0x6f0)
struct UM_MED_Prime_AnimBP_C : UCustomCharacterPartAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6f0(0x08)
	struct FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x6f8(0x02)
	char pad_6FA[0x6]; // 0x6fa(0x06)
	struct FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess; // 0x700(0x08)
	struct FAnimSubsystemInstance AnimBlueprintExtension_Base; // 0x708(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x710(0x20)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x730(0x990)
	struct FAnimNode_AnimDynamics ; // 0x10c0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x15d0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x1ae0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x1ff0(0x510)
	struct FAnimNode_Constraint ; // 0x2500(0x108)
	char pad_2608[0x8]; // 0x2608(0x08)
	struct FAnimNode_AnimDynamics ; // 0x2610(0x510)
	struct FAnimNode_AnimDynamics ; // 0x2b20(0x510)
	struct FAnimNode_AnimDynamics ; // 0x3030(0x510)
	struct FAnimNode_AnimDynamics ; // 0x3540(0x510)
	struct FAnimNode_AnimDynamics ; // 0x3a50(0x510)
	struct FAnimNode_Constraint ; // 0x3f60(0x108)
	struct FAnimNode_Constraint ; // 0x4068(0x108)
	struct FAnimNode_Constraint ; // 0x4170(0x108)
	struct FAnimNode_Constraint AnimGraphNode_Constraint; // 0x4278(0x108)
	struct FAnimNode_AnimDynamics ; // 0x4380(0x510)
	struct FAnimNode_AnimDynamics ; // 0x4890(0x510)
	struct FAnimNode_UseCachedPose ; // 0x4da0(0x28)
	char pad_4DC8[0x8]; // 0x4dc8(0x08)
	struct FAnimNode_AnimDynamics ; // 0x4dd0(0x510)
	struct FAnimNode_AnimDynamics ; // 0x52e0(0x510)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x57f0(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x5838(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x5858(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace ; // 0x5878(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace ; // 0x5898(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x58b8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x58d8(0x20)
	char pad_58F8[0x8]; // 0x58f8(0x08)
	struct FAnimNode_AnimDynamics ; // 0x5900(0x510)
	struct FAnimNode_AnimDynamics ; // 0x5e10(0x510)
	struct FAnimNode_AnimDynamics ; // 0x6320(0x510)
	struct FAnimNode_AnimDynamics ; // 0x6830(0x510)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6d40(0x28)
	char pad_6D68[0x8]; // 0x6d68(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x6d70(0x510)
	struct FAnimNode_ControlRig ; // 0x7280(0x470)
	struct FAnimNode_ControlRig AnimGraphNode_ControlRig; // 0x76f0(0x470)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x7b60(0x1d0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7d30(0x100)
	bool Crouching; // 0x7e30(0x01)
	bool Skydiving; // 0x7e31(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function M_MED_Prime_AnimBP.M_MED_Prime_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xda05cc
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function M_MED_Prime_AnimBP.M_MED_Prime_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xda05cc
	void ExecuteUbergraph_M_MED_Prime_AnimBP(int32_t EntryPoint); // Function M_MED_Prime_AnimBP.M_MED_Prime_AnimBP_C.ExecuteUbergraph_M_MED_Prime_AnimBP // (Final|UbergraphFunction) // @ game+0xda05cc
};

